#### SketchEditScope Members

---

|  |
| --- |
| SketchEditScope Class   Constructors   Methods   Properties   See Also |

The  SketchEditScope  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | SketchEditScope | Instantiates a SketchEditScope object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Cancel | Cancels the edit scope. (Inherited from  EditScope  .) |
| Public method | Commit | Finishes the edit scope. (Inherited from  EditScope  .) |
| Public method | Dispose | (Inherited from  EditScope  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsElementWithoutSketch | Validates if an element can have a sketch but currently does not. |
| Public method | IsSketchEditingSupported | Checks whether sketch can be edited. |
| Public method | IsSketchEditingSupportedForSketchBasedElement | Checks whether the element supports sketch editing. |
| Public method | Start | Starts a sketch edit mode. |
| Public method | StartWithNewSketch | Starts a sketch edit mode for an element which, at this moment, doesn't have a sketch. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsActive | Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet. (Inherited from  EditScope  .) |
| Public property | IsPermitted | Tells if the edit scope is permitted to start. (Inherited from  EditScope  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  EditScope  .) |

# See Also

SketchEditScope Class

Autodesk.Revit.DB Namespace